In [1]:
import pandas as pd

In [2]:
employee = pd.read_excel("Data.xlsx", sheet_name = 'Day 11')
employee

   id  salary
0   1    5500
1   2    8000
2   3    4700
3   4    9300
4   5    6700
5   6    5500

In [3]:
# Sort the Employee DataFrame by salary in descending order
sorted_employee = employee.sort_values(by='salary', ascending=False)
sorted_employee

   id  salary
3   4    9300
1   2    8000
4   5    6700
0   1    5500
5   6    5500
2   3    4700

In [4]:
# Drop duplicates and keep only unique salaries
unique_salaries = sorted_employee['salary'].unique()
unique_salaries

array([9300, 8000, 6700, 5500, 4700], dtype=int64)

In [13]:
# If N is greater than the number of unique salaries, return None
N = 8

if N > len(unique_salaries):
    result = pd.DataFrame({f'getNthHighestSalary({N})': [None]})
else:
    nth_highest = unique_salaries[N - 1]
    result = pd.DataFrame({f'getNthHighestSalary({N})': [nth_highest]})

In [14]:
result

  getNthHighestSalary(8)
0                   None

In [7]:
employee = pd.read_excel("Data.xlsx", sheet_name = 'Day 12')
employee

   id  salary
0   1    5500
1   2    8000
2   3    4700
3   4    9300
4   5    6700
5   6    5500

In [8]:
sorted_employee = employee.sort_values(by='salary', ascending=False)
sorted_employee

   id  salary
3   4    9300
1   2    8000
4   5    6700
0   1    5500
5   6    5500
2   3    4700

In [10]:
# Drop duplicates and keep the second row (if it exists)
result = sorted_employee.drop_duplicates(subset='salary', keep='first', inplace=False)
result

   id  salary
3   4    9300
1   2    8000
4   5    6700
0   1    5500
2   3    4700

In [11]:
# If there is no second highest salary, return None
if len(result) < 2:
    result = pd.DataFrame({'SecondHighestSalary': [None]})
else:
    result = pd.DataFrame({'SecondHighestSalary': [result.iloc[1]['salary']]})

In [12]:
result

   SecondHighestSalary
0                 8000